---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarManyLoopsError
source: html/fefb2ddb-ebee-a9d5-327d-dc27be440ed4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarManyLoopsError Property

Rebar Sketch contains more than one loop. Can't create Rebar.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarManyLoopsError { get; }
```